//
//  Questions.swift
//  MBTI_Finder
//
//  Created by SeongMinK on 2022/04/29.
//

import Foundation

class Questions: ObservableObject {
    let score = Score()
    // E, S, T, P 반복
    let questions: [String] = [
        "처음보는 아이들과도 쉽게 이야기하거나 친해지는 편이다",
        "‘이불처럼 폭신한 구름’이란 꾸밈어보다 ‘흰구름’처럼 단순한 말이 더 좋다",
        "'왜‘라는 질문을 자주 하는 편이다",
        "계획보다는 어떤 일이 닥치면 그때그때 처리하는 편이다",
        "모르는 사람들이 많이 모여있는 곳에서도 비교적 활발하게 행동하는 편이다",
        "주변 사람들의 얼굴, 키나 다른 특징들을 잘 기억한다",
        "끝까지 해내는 의지와 끈기가 강한 편이다",
        "숙제를 미루다가 마지막 순간에 해서 시간에 쫓길 때가 종종 있다",
        "주변에 친구나 아는 사람이 많다",
        "꾸준하고 참을성 있다는 말을 자주 듣는 편이다",
        "궁금한 게 있으면 하나하나 따져서 궁금증을 풀고 싶어한다",
        "방이 어수선하게 지저분해도 크게 신경쓰이지 않고 관심대상에 바로 집중하는편이다",
        "모임에서 다른 사람보다 말을 많이 하는 편이며 적극적으로 행동한다",
        "공부할 때 세세하고 자세한 내용을 잘 암기하는 편이다",
        "참을성이 있다는 말을 자주 듣는다",
        "주변일에 호기심이 많고 새로운 일이 생겨도 잘 적응한다",
        "슬프거나 기쁜 일이 생기면 즉시 부모님에게 이야기하는 편이다",
        "손으로 직접 만지거나 하나하나 조작하는 활동을 좋아한다",
        "야단을 맞거나 벌을 받아도 눈물을 잘 보이지 않는 편이다",
        "남의 지시에 따르기보다는 자신의 마음에 따라 행동하는 것이 좋다",
        "활발하고 적극적이라는 말을 많이 듣는 편이다",
        "꼼꼼하다는 말을 자주 듣는 편이다",
        "한 번 마음 먹은 일은 꾸준히 밀어나가 꼭 이뤄내는 편이다",
        "공책이나 책가방을 미리 챙기고 준비하는 편은 아니다",
        "시간이 걸리는 일, 놀이는 싫증을 빨리 내고 새로운 놀이, 활동을 원한다",
        "새로운 일이나 활동보다는 늘상 하는 일이 편안하다",
        "주변 어른들이 귀엽다고 쓰다듬어 주면 어색하다",
        "자신의 생각, 의견을 크게 주장하지는 않는다",
        "혼자 조용히 있거나 책을 읽는 것보다 사람들과 어울리는 게 좋다",
        "‘그게 정말이야?’라는 식의 질문을 많이 한다",
        "성적이 올랐거나 잘했을 때 직접적인 칭찬을 받는 게 좋다",
        "신발이나 옷이 떨어져도 무관심한 편이다",
        "새로운 유행이 시작되면 다른 친구들보다 먼저 시도해보는 편이다",
        "새로운 방법을 써보기보다는 친구들이 하는 대로 따라서 하는게 더 편하다",
        "부모님, 친구들에게 논리적이고 구체적인 설명으로 설득하는 편이다",
        "자기 것을 친구나 형제들한테 비교적 잘 나누어주는 편이다"
    ]
    
    func getQuestionText(at questionIndex: Int) -> String {
        if questionIndex < questions.count {
            return questions[questionIndex]
        } else {
            return "수고하셨습니다!"
        }
    }
    
    func getProgress(at questionIndex: Int) -> Double {
        return Double(questionIndex) / Double(questions.count)
    }
}
